---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FileNotFoundException
source: html/78b92446-fb74-7ab8-cb88-a002d2bdaa6b.htm
---
# FileNotFoundException Methods

Retrieves data needed to serialize the target object.